
01.	安装CornerStone
================================================================================

02. 具体操作
================================================================================

1>  添加远程代码仓库
2>  导出代码库到本地
3>  在本地目录下使用Xcode新建项目
注意：不要勾选 git，两套源代码管理同时存在会发生冲突
4>  提交到代码仓库
5>  其他用户操作

03. 忽略一些不需要上传的文件
================================================================================

04.	SVN演练
================================================================================

1>  修改viewcontroller,提交
2>  添加Person类,提交
3>  代码冲突演示
4>  storyboard冲突演示
5>  利用storyboard查看历史版本,回退
6>  利用xcode checkout 项目

05. 目录规范
================================================================================

1>  Trunk
目前项目正在开发的版本
通常进入公司之后在该目录下开发
2>  Tags
存放已经上线的重大版本
3>  Branches
当发生重大bug或者有新需求时



